site-build2/teaching.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-06-20 Tue 16:46 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Massimo Lauria @ Sapienza - Teaching</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Massimo Lauria">
<link rel='stylesheet' href='css/default.css' />
</head>
<body>
<div id="preamble" class="status">
<header>
      <nav>
        <ul class="nav">
          <li> <a href="index.html"> Home</a></li>
          <li> <a href="research.html">Research</a></li>
          <li> <a href="writings.html">Papers</a></li>
          <li class="current"> <a href="teaching.html">Teaching</a></li>
          <li> <a href="downloads.html">Software</a></li>
        </ul>
      </nav>
    </header>
</div>
<main id="content">

<article id="outline-container-org98989bb" class="outline-1">
<h1 id="org98989bb">Fall 2015 TokyoTech — Introduction to Proof Complexity</h1>
<div class="outline-text-1" id="text-org98989bb">
<p>
“Proof Complexity” is the study of the complexity of proving
propositional theorems.  In this  course we  discuss various
proof systems and we will show lower bounds for them.
</p>

<p>
More information can  be found  at the course <a href="courses/2015.ProofComplexity/">page</a>.
</p>
</div>
</article>


<article id="outline-container-orgfc65d61" class="outline-1">
<h1 id="orgfc65d61">Spring 2014 KTH — Sum of squares and integer programming relaxations</h1>
<div class="outline-text-1" id="text-orgfc65d61">
<p>
The strongest  approximation algorithms in literature  employ linear
and semidefinite positive relaxations of integer programs.
</p>

<p>
“Sum of  Squares” is  a simple computation  model that  captures all
such techniques.   We only know a  handful of lower bounds  for this
model,  very   few  compared   to  more  established   (but  weaker)
Lovász-Schrijver and Sherali-Adams hierarchies.
</p>

<p>
This course will  focus on Sum of Squares: we  will give an overview
of its relation  with these earlier systems, and we  will see how to
use  it to  develop better  approximation algorithms.  Then we  will
study its fundamental limitations, in the form of rank lower bounds.
</p>

<p>
<b>TIMEFRAME:</b> the  course will consist in  <b>16 lectures</b>
of 2  hours each. It  will start in  Week 05 (period  3) and
will finish in Week 15 (period 4).
</p>

<p>
More information can  be found  at the course <a href="http://www.csc.kth.se/~lauria/sos14/">page</a>.
</p>
</div>
</article>

<article id="outline-container-orge030eea" class="outline-1">
<h1 id="orge030eea">Fall 2012 KTH — Communication Complexity (Co-Lecturer)</h1>
<div class="outline-text-1" id="text-orge030eea">
<p>
This year the course 2D2441 (i.e. “Seminars on Theoretical
Computer Science”) is  devoted to Communication Complexity and
is taught by <a href="http://www.csc.kth.se/~jakobn/">Jakob Nordström</a>.
</p>

<p>
Consider  the following  problem:  Alice  and Bob  want to  compute
a function .  Alice has input while Bob  has input :
how  many bit  do they  need to  exchange in  order to  compute the
desired function?  The study  of such communication  complexity has
application   in   circuit    design,   data   stream   algorithms,
cryptography, ecc&#x2026;
</p>

<p>
More information can  be found  at the course <a href="http://www.csc.kth.se/utbildning/kth/kurser/DD2441/semteo12/">page</a>.
</p>
</div>
</article>

<article id="outline-container-org473d59e" class="outline-1">
<h1 id="org473d59e">2010-2011 Uniroma1 — Fondamenti di Programmazione (Esercitazioni)</h1>
<div class="outline-text-1" id="text-org473d59e">
<p>
Lo scopo delle esercitazioni di questo corso è quello di
introdurre gli studenti alla programmazione, utilizzando in
particolare il linguaggio C.  Le peculiarità di questo
linguaggio permettono agli studenti di acquisire familiarità
con il concetto di memoria, di puntatore, di gestione degli
indirizzi ed in generale di concetti che i linguaggi di
programmazione più moderni tendono a nascondere.
</p>

<p>
Per maggiori informazioni sul corso consiglio di visitare le seguenti pagine web:
</p>

<ul class="org-ul">
<li>La <a href="http://www.dsi.uniroma1.it/~galesi/fond.html">pagina principale</a> a cura del <a href="http://www.dsi.uniroma1.it/~galesi">Prof. Galesi</a></li>
<li>Il <a href="2010-Labprog-Uniroma1.html">diario delle esercitazioni</a> a cura di Massimo Lauria</li>
</ul>
</div>
</article>


<article id="outline-container-org0dc5a5d" class="outline-1">
<h1 id="org0dc5a5d">2009-2010 Uniroma1 — Metodi Matematici per L'Informatica (Esercitazioni)</h1>
<div class="outline-text-1" id="text-org0dc5a5d">
<p>
Nell’anno accademico 2009-2010 ho condotto le esercitazioni
del Canale P-Z del corso di “Metodi Matematici per
L’Informatica”. Le informazioni per questo corso non sono su
questo sito, e possono essere trovate alla seguente pagina <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
web:
</p>

<p>
<a href="http://twiki.di.uniroma1.it/twiki/view/Logica_PZ/WebHome">Metodi Matematici per L’Informatica (canale P-Z), anno accademico 2009-2010</a>
</p>

<p>
A grandi linee il corso introduce agli studenti i concetti più
semplici della logica e del ragionamento deduttivo.  Sia dal
punto di vista formale, attraverso lo studio dei sistemi
logici, sia dal punto di vista pratico, mettendoli di fronte
all’esigenza di capire, riprodurre e &lt;em&gt;produrre&lt;/em&gt;
dimostrazioni matematiche corrette.
</p>
</div>
</article>

<article id="outline-container-org81e0f22" class="outline-1">
<h1 id="org81e0f22">2007-2008 Uniroma1 — Architettura 2 (Tutoraggio)</h1>
<div class="outline-text-1" id="text-org81e0f22">
<p>
Qui potete trovare il codice sorgente legato alle sessioni di tutoraggio
per il corso di architettura 2. Se avete domande sul codice potete
contattarmi o farle durante le sessioni di tutoraggio. Alcuni di questi
programmi possono essere leggermente diversi da quelli visti in classe.
Vi prego di segnalare eventuali sviste ed errori nel codice!<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>
</p>

<p>
<b>Update:</b> <i>Il codice è stato rimosso.</i>
</p>
</div>
</article>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
la pagina web è morta.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
sssss
</p></div></div>


</div>
</div></main>
<div id="postamble" class="status">
<footer>
This site belongs to <a href="mailto:massimo.lauria@uniroma1.it">Massimo Lauria</a> and the content is published under
      <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">CC BY-NC-SA 4.0</a> license.
      Icons belong by <a href="http://brsev.com">Evan Brooks</a>.
    </footer>
</div>
</body>
</html>
